---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GeometryFailures.ElementIsTooThin
source: html/ceb344aa-9d3c-021e-bb59-71c505c47682.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GeometryFailures.ElementIsTooThin Property

[Element] is too thin.

## Syntax (C#)
```csharp
public static FailureDefinitionId ElementIsTooThin { get; }
```